#%%
#寻找水仙花数
#一个3位数，该数字每个位上数字的立方之和正好等于它本身，例如：$1^3 + 5^3+ 3^3=153$。
for num in range(100,1000):
    x = num//100
    y = num//10%10
    z = num%10
    if num == x**3+y**3+z**3:
        print(num)

# %%
#将一个正整数的反转

x = 12345
n = 0

while x > 0:
    n = n*10+x%10
    x//=10
print(n)

# %%
#百钱百鸡问题
#公鸡5元一只，母鸡3元一只，小鸡1元三只，用100块钱买一百只鸡
#问公鸡、母鸡、小鸡各有多少只？
x = 100
for i in range(0,20):
    for y in range(0,33):
        z = 100-i-y
        if 5*i+3*y+z/3 ==100:
            print('公鸡: %d只, 母鸡: %d只, 小鸡: %d只' % (i, y, z))
# %%
for x in range(0, 20):
    for y in range(0, 33):
        z = 100 - x - y
        if 5 * x + 3 * y + z / 3 == 100:
            print('公鸡: %d只, 母鸡: %d只, 小鸡: %d只' % (x, y, z))

# %%
